x1 = int(input()) # координата начала хода королевы
y1 = int(input()) # координата начала хода королевы
x2 = int(input()) # координата конца хода королевы
y2 = int(input()) # координата конца хода королевы
if 1 <= x1 <= 8 and 1 <= y1 <= 8 and 1 <= x2 <= 8 and 1 <= y2 <= 8:  # задаем размеры шахматной доски 8 на 8 клеток
  if (x1 - x2) ** 2 == (y1 - y2) ** 2:  # проверка хода по диагонали как у слона, по диагонали на 45 градусов
    print("YES")
  elif x1 == x2 or y1 == y2:  # проверка хода как у ладьи, крестом
    print('YES')
  elif (x1 - 1) <= x2 <= (x1 + 1) and (y1 - 1) <= y2 <= (y1 + 1):  # проверка хода на 1 клетку в разные стороны как у короля
    print("YES")
  else:
    print("NO")